[{
  "name": "help",
  "explanation": "This is used to get a List of all possible commands (you see them right now)"
}, {
  "name": "helloThere",
  "explanation": "Used to greet the Bot...if it's nice to you, it likes you"
}, {
  "name": "createGreeting",
  "explanation": "If you don't like what the bot has, you can add a new one. Make sure to provide a parameter"
}, {
  "name": "startBuzzer",
  "explanation": "Starts a small game. The winner is the first to buzz"
}, {
  "name": "buzz",
  "explanation": "Play with friends and see who is the first to buzz"
}, {
  "name": "plotUglyDiagram",
  "explanation": "Plots an ugly diagram. (Old command. Will be removed in later versions)"
}, {
  "name": "plotDiagram",
  "explanation": "Plots the results of a poll in a readable manner. There are 3 plotting types (raw, bar and pie), give one of them as an argument."
}, {
  "name": "inputData",
  "explanation": "is used for manually inputting data for plotting. Inputs need to be separate by :  (f.e.: A:3)"
}, {
  "name": "startPoll",
  "explanation": "Starts a poll. There are 3 polling types (public, private and Quick)give one of them as first argument. Then give all possible options for this poll as single arguments to the function."
}, {
  "name": "poll",
  "explanation": "give your vote for the active poll. You can ether pick the number of the option or the name of it as argument"
}, {
  "name": "activePoll",
  "explanation": "shows or changes active poll. If you use function without argument it will show the active poll. To change the active poll give poll id as argument (every poll has his id in the title-line)."
}, {
  "name": "endPoll",
  "explanation": "ends the active poll and prepares the data for plotting"
}, {
  "name": "resume",
  "explanation": "Restarts a paused track"
}, {
  "name": "stopPlaying",
  "explanation": "Stops everything and clears the queue"
}, {
  "name": "currentQueue",
  "explanation": "Prints out the current queue of tracks"
}, {
  "name": "startNumberedReactionRolls or snrr",
  "explanation": "creates a new Message with Reactions (Nummber from 1 to 10) you can click on to get the roll with the specified name. Give the roll names as arguments (exact name pls). Only 10 rolls can be given (if you need mor use srr)"
}, {
  "name": "startReactionRolls or srr",
  "explanation": "creates a new Message with costume Reactions you can click on to get the roll with the specified name. Give the roll names and emojis as arguments (exact name pls. Emojis must be in Unicode! Not Discords format(:test:)!). Please give Rolls and Emojis as Tuppel. F.e: roll9:9⃣ "
}]